deployment/docker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2021-02-12 Fri 23:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Docker</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="docker" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Docker</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2b9f305">1. 基本</a>
<ul>
<li><a href="#orgc66320d">1.1. 交互式启动</a></li>
<li><a href="#org2a63b09">1.2. 指定容器名</a></li>
<li><a href="#org2667726">1.3. 重启动</a></li>
<li><a href="#org565c01e">1.4. 运行中交互</a></li>
<li><a href="#org1c7d514">1.5. 守护进程启动</a></li>
<li><a href="#org3112fd8">1.6. logs</a></li>
<li><a href="#org8132c49">1.7. stats</a></li>
<li><a href="#orgecf7459">1.8. exec [command]</a></li>
<li><a href="#org2704768">1.9. 自动启动/自动重启</a></li>
<li><a href="#org39fad78">1.10. docker top, docker ps</a></li>
<li><a href="#org6da83f4">1.11. 查看镜像/容器详细信息</a></li>
<li><a href="#org9800456">1.12. 端口映射</a></li>
<li><a href="#org6beef0d">1.13. 删除全部容器</a></li>
</ul>
</li>
<li><a href="#org2948d27">2. 镜像</a>
<ul>
<li><a href="#orgeb665ad">2.1. 创建镜像</a></li>
<li><a href="#orge4835f3">2.2. Dockerfile 指令集</a></li>
<li><a href="#org3c44636">2.3. 推送镜像</a></li>
<li><a href="#org5e7c02f">2.4. 删除镜像</a></li>
<li><a href="#org62b77ce">2.5. 自建 Registry</a></li>
</ul>
</li>
<li><a href="#org63b666f">3. 建立连接</a>
<ul>
<li><a href="#org3cc77dc">3.1. Docker 内部网络</a></li>
<li><a href="#org692610d">3.2. Docker Networking</a></li>
<li><a href="#org81709c0">3.3. Docker Link</a></li>
</ul>
</li>
<li><a href="#org4e98ef5">4. Docker Machine</a></li>
<li><a href="#org9514769">5. Docker Compose</a></li>
<li><a href="#orgae14039">6. Docker Swarm</a>
<ul>
<li><a href="#org4cf77c4">6.1. Node</a></li>
<li><a href="#orgd8a1510">6.2. Task</a></li>
<li><a href="#org715a272">6.3. Service</a></li>
<li><a href="#org1344524">6.4. work with compose</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2b9f305" class="outline-2">
<h2 id="org2b9f305"><span class="section-number-2">1</span> 基本</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc66320d" class="outline-3">
<h3 id="orgc66320d"><span class="section-number-3">1.1</span> 交互式启动</h3>
<div class="outline-text-3" id="text-1-1">
<p>
docker run -ti &#x2026;
</p>
</div>
</div>
<div id="outline-container-org2a63b09" class="outline-3">
<h3 id="org2a63b09"><span class="section-number-3">1.2</span> 指定容器名</h3>
<div class="outline-text-3" id="text-1-2">
<p>
docker run &#x2013;name &#x2026;
</p>
</div>
</div>
<div id="outline-container-org2667726" class="outline-3">
<h3 id="org2667726"><span class="section-number-3">1.3</span> 重启动</h3>
<div class="outline-text-3" id="text-1-3">
<p>
docker start container
</p>
</div>
</div>
<div id="outline-container-org565c01e" class="outline-3">
<h3 id="org565c01e"><span class="section-number-3">1.4</span> 运行中交互</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>docker attach container</li>
<li>docker exec -t -i container /bin/bash</li>
</ul>
</div>
</div>
<div id="outline-container-org1c7d514" class="outline-3">
<h3 id="org1c7d514"><span class="section-number-3">1.5</span> 守护进程启动</h3>
<div class="outline-text-3" id="text-1-5">
<p>
docker run -d
</p>
</div>
</div>
<div id="outline-container-org3112fd8" class="outline-3">
<h3 id="org3112fd8"><span class="section-number-3">1.6</span> logs</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgb061f87" class="outline-4">
<h4 id="orgb061f87"><span class="section-number-4">1.6.1</span> 跟踪日志</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
docker logs -f container
</p>
</div>
</div>
<div id="outline-container-orga82e660" class="outline-4">
<h4 id="orga82e660"><span class="section-number-4">1.6.2</span> 限制最后 n 条</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
docker logs &#x2013;tail n -f container
</p>
</div>
</div>
<div id="outline-container-org4fd13c4" class="outline-4">
<h4 id="org4fd13c4"><span class="section-number-4">1.6.3</span> log driver</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
docker run &#x2013;log-driver="syslog" &#x2026;
</p>
</div>
</div>
</div>
<div id="outline-container-org8132c49" class="outline-3">
<h3 id="org8132c49"><span class="section-number-3">1.7</span> stats</h3>
<div class="outline-text-3" id="text-1-7">
<p>
docker stats container1 container2 &#x2026;
</p>
</div>
</div>
<div id="outline-container-orgecf7459" class="outline-3">
<h3 id="orgecf7459"><span class="section-number-3">1.8</span> exec [command]</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-bash">docker exec -d container [command]
docker exec -t -i container /bin/bash
</pre>
</div>
</div>
</div>

<div id="outline-container-org2704768" class="outline-3">
<h3 id="org2704768"><span class="section-number-3">1.9</span> 自动启动/自动重启</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-bash">docker run --restart=always --name daemon_dave -d ubuntu /
&#12288;bin/sh -c <span style="color: #2d9574;">"while true; do echo hello world; sleep 1; done"</span>
docker container update --restart=always [container]
</pre>
</div>
<p>
其他选项，例如：退出代码为非 0 时，Docker 会尝试自动重启，最多重启 5 次：
&#x2013;restart=on-failure:5
</p>
</div>
</div>

<div id="outline-container-org39fad78" class="outline-3">
<h3 id="org39fad78"><span class="section-number-3">1.10</span> docker top, docker ps</h3>
<div class="outline-text-3" id="text-1-10">
<p>
docker top 查看容器运行情况
docker ps -a 可列出所有容器(包括未运行的容器)
</p>
</div>
</div>

<div id="outline-container-org6da83f4" class="outline-3">
<h3 id="org6da83f4"><span class="section-number-3">1.11</span> 查看镜像/容器详细信息</h3>
<div class="outline-text-3" id="text-1-11">
<p>
docker inspect container/image
</p>
</div>
</div>

<div id="outline-container-org9800456" class="outline-3">
<h3 id="org9800456"><span class="section-number-3">1.12</span> 端口映射</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#32465;&#23450;&#31471;&#21475;</span>
docker run -p [outer_port]:[inner_port]
docker run -P <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#36981;&#24490; Dockerfile EXPOSE</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26597;&#30475;&#31471;&#21475;&#26144;&#23556;</span>
docker ps -l
docker port container inner_port
</pre>
</div>
</div>
</div>
<div id="outline-container-org6beef0d" class="outline-3">
<h3 id="org6beef0d"><span class="section-number-3">1.13</span> 删除全部容器</h3>
<div class="outline-text-3" id="text-1-13">
<p>
docker rm `sudo docker ps -a -q`
</p>
</div>
</div>
</div>

<div id="outline-container-org2948d27" class="outline-2">
<h2 id="org2948d27"><span class="section-number-2">2</span> 镜像</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>docker pull [user/]repo[:tag]</li>
<li>docker push [user/]repo[:tag]</li>
<li>docker images</li>
<li>docker search</li>
</ul>
</div>
<div id="outline-container-orgeb665ad" class="outline-3">
<h3 id="orgeb665ad"><span class="section-number-3">2.1</span> 创建镜像</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org72f9f39" class="outline-4">
<h4 id="org72f9f39"><span class="section-number-4">2.1.1</span> login</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
docker login
</p>
</div>
</div>
<div id="outline-container-orgf3fd0b1" class="outline-4">
<h4 id="orgf3fd0b1"><span class="section-number-4">2.1.2</span> commit</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-bash">docker run -ti image_to_modify /bin/bash
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">modify in container</span>
docker commit container user/repo -m <span style="color: #2d9574;">"comment"</span> -a <span style="color: #2d9574;">"User Name"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org21fc1fb" class="outline-4">
<h4 id="org21fc1fb"><span class="section-number-4">2.1.3</span> Dockerfile</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
例子：
</p>
<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Version: 0.0.1&#12288;</span>
<span style="color: #3a81c3; font-weight: bold;">FROM</span> <span style="color: #ba2f59; font-weight: bold;">ubuntu:14.04&#12288;</span>
<span style="color: #3a81c3; font-weight: bold;">MAINTAINER</span> XXX <span style="color: #2d9574;">"xxx@xxx.com"</span>
<span style="color: #3a81c3; font-weight: bold;">ENV</span> REFRESHED_AT 2017-07-01 <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#34920;&#26126;&#35813;&#38236;&#20687;&#27169;&#26495;&#26368;&#21518;&#30340;&#26356;&#26032;&#26102;&#38388;&#65292;Docker &#22312;&#21629;&#20013; ENV &#25351;&#20196;&#26102;&#24320;&#22987;&#37325;&#32622;&#36825;&#20010;&#38236;&#20687;&#32531;&#23384;</span>
<span style="color: #3a81c3; font-weight: bold;">RUN</span> apt-get update &amp;&amp; apt-get install -y nginx&#12288;
<span style="color: #3a81c3; font-weight: bold;">RUN</span> echo <span style="color: #2d9574;">'Hi, I am in your container'</span> <span style="color: #2d9574;">\</span>
&#12288;&#12288; &gt;/usr/share/nginx/html/index.html&#12288;
<span style="color: #3a81c3; font-weight: bold;">EXPOSE</span> 80 <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21482;&#26159;&#32473;&#22806;&#30028;&#30475;&#30340;&#65292;&#20855;&#20307;&#20351;&#29992;&#21738;&#20010;&#31471;&#21475;&#22312; run &#26102;&#25351;&#23450;&#65292;&#25110;&#20351;&#29992; docker run &#30340;-P &#36873;&#39033;&#29983;&#25928;</span>
</pre>
</div>
<p>
RUN 指令默认会在 shell 里使用命令包装器/bin/sh -c 来执行。exec 格式 RUN 指令:
</p>
<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #3a81c3; font-weight: bold;">RUN</span> [ <span style="color: #2d9574;">"apt-get"</span>, <span style="color: #2d9574;">" install"</span>, <span style="color: #2d9574;">"-y"</span>, <span style="color: #2d9574;">"nginx"</span> ]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">docker build -t [username]/[image_name]:[tag]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf3dba4" class="outline-4">
<h4 id="orgcf3dba4"><span class="section-number-4">2.1.4</span> docker build</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
docker build -t="user/repo:tag"
Dockerfile 一般放在项目根目录，指定 Dockerfile 路径使用-f 选项
.dockerignore 指定忽略文件。
</p>
</div>
</div>
<div id="outline-container-orge706b4e" class="outline-4">
<h4 id="orge706b4e"><span class="section-number-4">2.1.5</span> docker history</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
查看构建过程
</p>
</div>
</div>
</div>
<div id="outline-container-orge4835f3" class="outline-3">
<h3 id="orge4835f3"><span class="section-number-3">2.2</span> Dockerfile 指令集</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org9b4b175" class="outline-4">
<h4 id="org9b4b175"><span class="section-number-4">2.2.1</span> CMD</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
指定容器启动时运行的命令，docker run 末尾的命令如果与 CMD 指定的重叠，则 CMD 中的不会运行
</p>
</div>
</div>
<div id="outline-container-orgff3f357" class="outline-4">
<h4 id="orgff3f357"><span class="section-number-4">2.2.2</span> ENTRYPOINT</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
可使与 docker run 末尾的重复命令不生效
</p>
</div>
</div>
<div id="outline-container-orgd30d34b" class="outline-4">
<h4 id="orgd30d34b"><span class="section-number-4">2.2.3</span> WORKDIR</h4>
</div>
<div id="outline-container-org551af45" class="outline-4">
<h4 id="org551af45"><span class="section-number-4">2.2.4</span> ENV</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
ENV 指令用于在容器中永久的建立环境变量
</p>
<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #3a81c3; font-weight: bold;">ENV</span> <span style="color: #715ab1;">MYENV1</span>=XXX <span style="color: #715ab1;">MYENV2</span>=XXX <span style="color: #715ab1;">TARGET_DIR</span>=/opt/app
<span style="color: #3a81c3; font-weight: bold;">WORKDIR</span> $<span style="color: #715ab1;">TARGET_DIR</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgebde5c0" class="outline-4">
<h4 id="orgebde5c0"><span class="section-number-4">2.2.5</span> USER</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
指定用户运行镜像
</p>
<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #3a81c3; font-weight: bold;">USER</span> user/uid
<span style="color: #3a81c3; font-weight: bold;">USER</span> [user/uid]:[group/gid]
</pre>
</div>
</div>
</div>
<div id="outline-container-org8581f21" class="outline-4">
<h4 id="org8581f21"><span class="section-number-4">2.2.6</span> VOLUME</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
VOLUME 指令用来向基于镜像创建的容器添加卷
</p>
<ul class="org-ul">
<li>卷可以在容器间共享和重用</li>
<li>一个容器可以不和其他容器共享卷</li>
<li>对卷的修改是立时生效的</li>
<li>对卷的修改不会对更新镜像产生影响</li>
<li>卷会一直存在直到没有任何容器再使用它</li>
</ul>
<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #3a81c3; font-weight: bold;">VOLUME</span> [<span style="color: #2d9574;">"/opt/project"</span>]
<span style="color: #3a81c3; font-weight: bold;">VOLUME</span> [<span style="color: #2d9574;">"/opt/project"</span>, <span style="color: #2d9574;">"/data"</span> ]
</pre>
</div>
</div>
</div>
<div id="outline-container-org2fc11f8" class="outline-4">
<h4 id="org2fc11f8"><span class="section-number-4">2.2.7</span> ADD</h4>
</div>
<div id="outline-container-org923e394" class="outline-4">
<h4 id="org923e394"><span class="section-number-4">2.2.8</span> COPY</h4>
</div>
<div id="outline-container-orgf3a58c2" class="outline-4">
<h4 id="orgf3a58c2"><span class="section-number-4">2.2.9</span> LABEL</h4>
</div>
<div id="outline-container-org82f81aa" class="outline-4">
<h4 id="org82f81aa"><span class="section-number-4">2.2.10</span> STOPSIGNAL</h4>
</div>
<div id="outline-container-org2368dad" class="outline-4">
<h4 id="org2368dad"><span class="section-number-4">2.2.11</span> ARG</h4>
</div>
<div id="outline-container-org679174e" class="outline-4">
<h4 id="org679174e"><span class="section-number-4">2.2.12</span> ONBUILD</h4>
</div>
</div>
<div id="outline-container-org3c44636" class="outline-3">
<h3 id="org3c44636"><span class="section-number-3">2.3</span> 推送镜像</h3>
<div class="outline-text-3" id="text-2-3">
<p>
先登录 docker login，docker push 推送镜像到 docker hub
</p>
</div>
<ul class="org-ul">
<li><a id="org3c365dc"></a>自动推送<br />
<div class="outline-text-5" id="text-org3c365dc">
<p>
为了使用自动构建，我们只需要将 GitHub 或 BitBucket 中含有 Dockerfile 文件的仓库连接到 Docker Hub 即可。
向这个代码仓库推送代码时，将会触发一次镜像构建活动并创建一个新镜像。
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org5e7c02f" class="outline-3">
<h3 id="org5e7c02f"><span class="section-number-3">2.4</span> 删除镜像</h3>
<div class="outline-text-3" id="text-2-4">
<p>
docker rmi
</p>
</div>
<ul class="org-ul">
<li><a id="org37ff735"></a>全部删除<br />
<div class="outline-text-5" id="text-org37ff735">
<p>
docker rmi `docker images -a -q`
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org62b77ce" class="outline-3">
<h3 id="org62b77ce"><span class="section-number-3">2.5</span> 自建 Registry</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orgfe7843b" class="outline-4">
<h4 id="orgfe7843b"><span class="section-number-4">2.5.1</span> 部署</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-bash">docker run -p 5000:5000 registry
</pre>
</div>
</div>
</div>
<div id="outline-container-org3384593" class="outline-4">
<h4 id="org3384593"><span class="section-number-4">2.5.2</span> 上传 image 到 registry</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-bash">docker tag image_id registry_host:registry_port/user/repo:tag
</pre>
</div>
</div>
</div>
<div id="outline-container-org9141b7c" class="outline-4">
<h4 id="org9141b7c"><span class="section-number-4">2.5.3</span> 运行 registry 中的镜像</h4>
<div class="outline-text-4" id="text-2-5-3">
<div class="org-src-container">
<pre class="src src-bash">sudo docker run -t -i host:port/user/repo:tag /bin/bash
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org63b666f" class="outline-2">
<h2 id="org63b666f"><span class="section-number-2">3</span> 建立连接</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3cc77dc" class="outline-3">
<h3 id="org3cc77dc"><span class="section-number-3">3.1</span> Docker 内部网络</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><code>ip a show docker0</code>: show docker0 interface</li>
<li>接口 docker0 是一个虚拟的以太网桥,用于连接容器和本地宿主网络</li>
<li>每个容器都有一个接口，一端连接容器里的 eth0 接口，另一端为在宿主机上的 veth****接口。veth****直接连上 docker0 网桥</li>
<li><code>sudo iptables -t nat -L -n</code></li>
<li><code>docker inspect container</code></li>
</ul>

<p>
最大的问题在于容器重启会改变 IP
</p>
</div>
</div>

<div id="outline-container-org692610d" class="outline-3">
<h3 id="org692610d"><span class="section-number-3">3.2</span> Docker Networking</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sh">docker network create app <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21019;&#24314;</span>
docker network inspect app <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26597;&#30475;</span>

docker network ls <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">list</span>
</pre>
</div>
<p>
使用 <code>--network</code> 参数指定容器运行网络
</p>
</div>
<div id="outline-container-org8dbb081" class="outline-4">
<h4 id="org8dbb081"><span class="section-number-4">3.2.1</span> 已有容器网络操作</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-sh">docker network connect app container1
docker network disconnect app container1
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org81709c0" class="outline-3">
<h3 id="org81709c0"><span class="section-number-3">3.3</span> Docker Link</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><code>--link targetname:alias</code>: try ping alias in container</li>
<li>容器内新增环境变量 <code>ALIAS_NAME, ALIAS_PORT</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4e98ef5" class="outline-2">
<h2 id="org4e98ef5"><span class="section-number-2">4</span> Docker Machine</h2>
<div class="outline-text-2" id="text-4">
<p>
快速创建一个虚拟 docker 主机
</p>
</div>
</div>
<div id="outline-container-org9514769" class="outline-2">
<h2 id="org9514769"><span class="section-number-2">5</span> Docker Compose</h2>
</div>
<div id="outline-container-orgae14039" class="outline-2">
<h2 id="orgae14039"><span class="section-number-2">6</span> Docker Swarm</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org4cf77c4" class="outline-3">
<h3 id="org4cf77c4"><span class="section-number-3">6.1</span> Node</h3>
</div>
<div id="outline-container-orgd8a1510" class="outline-3">
<h3 id="orgd8a1510"><span class="section-number-3">6.2</span> Task</h3>
</div>
<div id="outline-container-org715a272" class="outline-3">
<h3 id="org715a272"><span class="section-number-3">6.3</span> Service</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-bash">docker service create
</pre>
</div>
<p>
mode: replicated, global
</p>
</div>
</div>

<div id="outline-container-org1344524" class="outline-3">
<h3 id="org1344524"><span class="section-number-3">6.4</span> work with compose</h3>
<div class="outline-text-3" id="text-6-4">
<p>
<code>docker stack</code>
</p>
<ul class="org-ul">
<li>show errors before running container: <code>docker service ps --no-trunc {serviceName}</code></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
